{
  "workflow": [
    {
      "step": "1. Plan your session.",
      "description": "Review the workflow. Research/review the relevant Marlin Configuration guidelines."
    },
    {
      "step": "2. Select target printer from picklist",
      "description": "Choose the target printer configuration from the dropdown menu. If the default environment text is RED, click 'copy env to platformio.ini'."
    },
    {
      "step": "3. Select and review objectives",
      "description": "Select one objective at a time and review the flash card for keywords and background info."
    },
    {
      "step": "Load the file you need to edit",
      "description": "Select either Configuration.h or Configuration_adv.h to edit. Choose whether to load the base configuration file, a configuration example file, or browse and select another file."
    },
    {
      "step": "Filter and modify settings",
      "description": "Find and edit the relevant configuration settings. Start with Keywords from flash card. Hide Comments and type keywords, to filter the displayed lines. View in Context to understand a line in context."
    },
    {
      "step": "Save your changes",
      "description": "Save Edit, to commit your changes.  Save File to either: Overwrite the Base file directly, or Browse and SaveAs, elsewhere."
    },
    {
      "step": "Verify that the platformio environment and both Configuration*.h files are 'Ready' to Build",
      "description": "You must check the boxes for Configuration.h OK and Configuration_adv.h OK and must ensure the platformio environment is set up correctly, before the Build Firmware button will turn green."
    },
    {
      "step": "Build your customized firmware",
      "description": "When the Build Firmware button is green, click it to build your firmware. A popup message will ask you to confirm the build parameters. A window will open to show you the build process.  A build.log file will be created and stored with each individual build. The location of the bin file will be reported in that terminal window."
    }
  ]
}
